Tested with 1.1.16 beta. We are getting closer, but it still does not work as expected. There are two issues that I observe:
1. Resource creation always fails on first attempt
2. Resource changes made in DNAC GUI are not detected by terraform state refresh.

Issue 1. 
First creation attempt(tf apply) fails, state not created, however ip pool is created in DNAC. Terraform output:
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # dnacenter_sda_virtual_network_ip_pool.l2["Global/MINIHF/OSL/profiling_quarantine"] will be created
  + resource "dnacenter_sda_virtual_network_ip_pool" "l2" {
      + id           = (known after apply)
      + item         = (known after apply)
      + last_updated = (known after apply)

      + parameters {
          + auto_generate_vlan_name  = "false"
          + ip_pool_name             = "profiling_quarantine"
          + is_bridge_mode_vm        = (known after apply)
          + is_common_pool           = "false"
          + is_ip_directed_broadcast = (known after apply)
          + is_l2_flooding_enabled   = "true"
          + is_layer2_only           = "true"
          + is_this_critical_pool    = (known after apply)
          + is_wireless_pool         = "false"
          + pool_type                = (known after apply)
          + scalable_group_name      = (known after apply)
          + site_name_hierarchy      = "Global/MINIHF/OSL"
          + traffic_type             = "Data"
          + virtual_network_name     = "OSL_medtek"
          + vlan_id                  = (known after apply)
          + vlan_name                = "profiling_quarantine"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
dnacenter_sda_virtual_network_ip_pool.l2["Global/MINIHF/OSL/profiling_quarantine"]: Creating...
dnacenter_sda_virtual_network_ip_pool.l2["Global/MINIHF/OSL/profiling_quarantine"]: Still creating... [10s elapsed]
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "pnp_ap" but a value was found in file "/opt/dnac/tfvars/dnac.devhf.latest.json". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide certain "global" settings to all configurations in your organization. To reduce the
│ verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Error: Provider produced inconsistent result after apply
│ 
│ When applying changes to dnacenter_sda_virtual_network_ip_pool.l2["Global/MINIHF/OSL/profiling_quarantine"], provider
│ "provider[\"registry.terraform.io/cisco-en-programmability/dnacenter\"]" produced an unexpected new value: Root resource was present, but now absent.
│ 
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
```
Terraform log: [dnac.1.sanitized.log](https://github.com/cisco-en-programmability/terraform-provider-dnacenter/files/12597354/dnac.1.sanitized.log)

Second creation attempt succeeds:
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # dnacenter_sda_virtual_network_ip_pool.l2["Global/MINIHF/OSL/profiling_quarantine"] will be created
  + resource "dnacenter_sda_virtual_network_ip_pool" "l2" {
      + id           = (known after apply)
      + item         = (known after apply)
      + last_updated = (known after apply)

      + parameters {
          + auto_generate_vlan_name  = "false"
          + ip_pool_name             = "profiling_quarantine"
          + is_bridge_mode_vm        = (known after apply)
          + is_common_pool           = "false"
          + is_ip_directed_broadcast = (known after apply)
          + is_l2_flooding_enabled   = "true"
          + is_layer2_only           = "true"
          + is_this_critical_pool    = (known after apply)
          + is_wireless_pool         = "false"
          + pool_type                = (known after apply)
          + scalable_group_name      = (known after apply)
          + site_name_hierarchy      = "Global/MINIHF/OSL"
          + traffic_type             = "Data"
          + virtual_network_name     = "OSL_medtek"
          + vlan_id                  = (known after apply)
          + vlan_name                = "profiling_quarantine"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
dnacenter_sda_virtual_network_ip_pool.l2["Global/MINIHF/OSL/profiling_quarantine"]: Creating...
dnacenter_sda_virtual_network_ip_pool.l2["Global/MINIHF/OSL/profiling_quarantine"]: Creation complete after 1s [id=ip_pool_name:=profiling_quarantine\site_name_hierarchy:=Global/MINIHF/OSL\virtual_network_name:=OSL_medtek]
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "pnp_ap" but a value was found in file "/opt/dnac/tfvars/dnac.devhf.latest.json". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide certain "global" settings to all configurations in your organization. To reduce the
│ verbosity of these warnings, use the -compact-warnings option.
╵

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

vns = <sensitive>
```

[dnac.2.sanitized.log](https://github.com/cisco-en-programmability/terraform-provider-dnacenter/files/12597370/dnac.2.sanitized.log)

Issue 2
I changed `traffic_type` and `is_wireless_pool` parameters in DNAC GUI, and then ran `terraform plan`. It did not detect any changes. Here is the log where terraform fetches necessary data from DNAC (GET  /dna/intent/api/v1/business/sda/virtualnetwork/ippool) but does not detect that mentioned fields has been update. 
[dnac.sanitized.log](https://github.com/cisco-en-programmability/terraform-provider-dnacenter/files/12597626/dnac.sanitized.log)

